Tekla Open API Reference for Tekla Structures 2025
MaterialItemEnumerator Properties
The MaterialItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a material item instance of the current element.
Top
See Also
Reference
MaterialItemEnumerator Class
Tekla.Structures.Catalogs Namespace